#pragma once
/*
////////////////////////////
keyboard////////////////////
////////////////////////////

void glutKeyboardFunc(void (*f)(unsigned char key, int x, int y))
Регистрирует функцию f (), вызываемую при нажатии клавиши;
(x, y) всегда измеряется в верхнем левом углу окна

void glutSpecialFunc(void (*f)(int key, int x, int y))
Регистрирует обратный вызов, который обрабатывает специальные клавиши (функция,
стрелки и т. д.)


int glutGetModifiers( )
Верните один из GLUT_ACTIVE_SHIFT, GLUT_ACTIVE_CTRL
или GLUT_ACTIVE_ALT, если клавиша нажата, когда клавиатура
или событие мыши
////////////////////////////////////////////////////////////////////



*/